[
    {
        "citation": "George is very much supportive, responsible and committed resource to take up the work. His role and responsibilities in GDW testing in GFR are is very crucial. He played a very critical role , very efficient team player with outstanding communication skills, handled calls without any escalations. He has handled several critical demands without any issues/escalations and keen observation skills which has improved the overall quality of GDW testing before the customer.",
        "recognition": "**Bravo**",
        "jury": "Namagiri Ramesh",
        "designation": "IBU Head - Testing-01",
        "workplace": "TechMahindra",
        "date": "FY 14/15 Q1"
    },
    {
        "citation": "The team is handling dynamic areas which is different from the OSS-BSS stack. Requiring expertise to cater to a varied set of technologies in domains like Finance, HR, SCM, BI, Fleet, Energy, and Security. Handling variuos forms of testing like - Enterprise testing, Device testing, Browser testing, Migration testing, Witness testing, Reconciliation testing, etc. The team has received a high CSAT score of 4.5. Appreciated by BT's exec leadership in form of 5+ e-cards in last 6 months. 5. Pankaj Kumar, was voted to be the Testing Manager of the year in the recently concluded TESTA awards in London. This year the team has 2 Blue Ribbon entries in the prestigious T10 Challenge Cup.",
        "recognition": "**Best Team Award**",
        "jury": "Namagiri Ramesh",
        "designation": "IBU Head - Testing-01",
        "workplace": "TechMahindra",
        "date": "FY 15/16 Q1"

    },
    {
        "citation": "George is very committed, hard working and provided excellent support to the ECloud project, both in development and testing. He could pick up any new language/technology with ease. Now he is providing excellent support to the new Cloud modernization project. All the very best, george and keep up the good work!",
        "recognition": "**Bravo**",
        "jury": "Ranganath Rajaiyengar",
        "designation": "IBU Head - Product Engineering",
        "workplace": "TechMahindra",
        "date": "FY 15/16 Q4"

    },
    {
        "citation": "Tech Mahindra applauds you for consistently challenging yourself and performing brilliantly. Keep up the passion. We are proud of you!",
        "recognition": "**ACE Award**",
        "jury": "C P Gurnani, MD & CEO & ",
        "designation": "Rakesh Soni, CPO",
        "workplace": "TechMahindra",
        "date": "May 2016"
    },
    {
        "citation": "Recognized as 'Emerging Leader' - an integrated Talent pipeline for Tech Mahindra across the globe. Was Organizer for the Chennai chapter.",
        "recognition": "**Emerging Leader**",
        "jury": "Tech Mahindra 1000 Leaders",
        "designation": "",
        "workplace": "TechMahindra",
        "date": "April 2014"

    },
    {
        "citation": "Recognized as 'Star' and 'Excellent' Performer - 2015 & 2016",
        "recognition": "**Star and Excellent Performer**",
        "jury": "Product Delivery & Management",
        "designation": "",
        "workplace": "TechMahindra",
        "date": "2015 & 2016"

    }
]